a-container-for-my-dbs/pgsql-lxc-1.out
sysbench --db-driver=pgsql --pgsql-host=10.0.3.32 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=1 --time=1200 run --tables=1 --table-size=10000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5653858
        write:                           1615388
        other:                           807694
        total:                           8076940
    transactions:                        403847 (336.54 per sec.)
    queries:                             8076940 (6730.77 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0009s
    total number of events:              403847

Latency (ms):
         min:                                    2.13
         avg:                                    2.97
         max:                                  406.14
         95th percentile:                        3.55
         sum:                              1199037.77

Threads fairness:
    events (avg/stddev):           403847.0000/0.00
    execution time (avg/stddev):   1199.0378/0.00

sysbench --db-driver=pgsql --pgsql-host=10.0.3.32 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=1 --time=1200 run --tables=1 --table-size=10000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5626614
        write:                           1607604
        other:                           803802
        total:                           8038020
    transactions:                        401901 (334.92 per sec.)
    queries:                             8038020 (6698.33 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0019s
    total number of events:              401901

Latency (ms):
         min:                                    2.12
         avg:                                    2.98
         max:                                  494.66
         95th percentile:                        3.62
         sum:                              1199114.43

Threads fairness:
    events (avg/stddev):           401901.0000/0.00
    execution time (avg/stddev):   1199.1144/0.00

sysbench --db-driver=pgsql --pgsql-host=10.0.3.32 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=1 --time=1200 run --tables=1 --table-size=10000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5702424
        write:                           1629264
        other:                           814632
        total:                           8146320
    transactions:                        407316 (339.43 per sec.)
    queries:                             8146320 (6788.57 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0029s
    total number of events:              407316

Latency (ms):
         min:                                    2.10
         avg:                                    2.94
         max:                                  380.78
         95th percentile:                        3.55
         sum:                              1198953.33

Threads fairness:
    events (avg/stddev):           407316.0000/0.00
    execution time (avg/stddev):   1198.9533/0.00